---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.GetPath
zh: 栏杆
source: html/70531de6-1d62-d37f-2b20-721cc68d2f9e.htm
---
# Autodesk.Revit.DB.Architecture.Railing.GetPath Method

**中文**: 栏杆

Gets the railing path.

## Syntax (C#)
```csharp
public IList<Curve> GetPath()
```

## Returns
The curve array of the railing path.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The railing has incorrect internal data.